"use client";
import Image from "next/image";
import img1 from "../../../../src/assets/images/khaleda-zia/1.jpeg";
import Container from "@/components/share/Container";
import { useState } from "react";
import Modal from "./_components/Modal";

const BiographyPage = () => {
  const biography = [
    {
      id: 1,
      image: img1,
      title: "প্রধানমন্ত্রী হিসেবে দায়িত্ব পালন",
      content:
        "বেগম খালেদা জিয়া ১৯৯১ থেকে ১৯৯৬ এবং ২০০১ থেকে ২০০৬ পর্যন্ত বাংলাদেশের প্রধানমন্ত্রী হিসেবে দায়িত্ব পালন করেন। তিনি বাংলাদেশের ইতিহাসে প্রথম মহিলা এবং মুসলিম বিশ্বের দ্বিতীয় মহিলা (পাকিস্তানের বেনজির ভুট্টোর পরে) প্রধানমন্ত্রী হিসেবে গণতান্ত্রিক সরকারের প্রধান ছিলেন।",
    },
    {
      id: 2,
      image: img1,
      title: " ঐতিহাসিক নেতৃত্ব ও রাজনৈতিক কৃতিত্ব",
      content:
        "বাংলাদেশের মুক্তিযুদ্ধের অন্যতম নায়ক, স্বাধীনতার ঘোষক এবং পরে প্রজাতন্ত্রের রাষ্ট্রপতি হন এবং ১৯৭৭ সালের এপ্রিলে বাংলাদেশ জাতীয়তাবাদী দল (বিএনপি) গঠন করেন। ৩০ মে, ১৯৮১ সালে রাষ্ট্রপতি রহমানকে হত্যা করা হয়। ১৯৮৪ সালের আগস্টে, পার্টি বেগম খালেদা জিয়াকে চেয়ারপার্সন নির্বাচিত করে। বাংলাদেশের স্বাধীনতার ৩৫ বছর পর তিনি প্রায় দশ বছর (দীর্ঘ সময়কাল) দেশ শাসন করেছেন। তিনি ১৯৯১, ১৯৯৬ এবং ২০০১ সালের সাধারণ নির্বাচনে পাঁচটি পৃথক সংসদীয় আসনে নির্বাচিত হয়েছেন, যা বাংলাদেশের ইতিহাসে এক অনন্য কৃতিত্ব। ২০০৬ সালে, ফোর্বস বিশ্বের ১০০ জন ক্ষমতাধর নারীর তালিকায় খালেদা জিয়াকে ৩৩ নম্বরে স্থান দেওয়া হয়।",
    },
   
    {
      id: 4,
      image: img1,
      title: " শৈশব ও পারিবারিক পটভূমি",
      content:
        "বেগম খালেদা জিয়া ১৫ আগস্ট ১৯৪৫ সালে বাংলাদেশের উত্তর-পশ্চিমাঞ্চলের দিনাজপুর জেলায় মুদিপাড়ায়  জন্মগ্রহণ করেন। বেগম খালেদা জিয়ার আসল নাম খালেদা খানম পুতুল। তিন বোন ও দুই ভাইয়ের মধ্যে তিনি তৃতীয়। ভাইয়েরা সবার ছোট। তার দাদা হাজী সালামত আলী, দাদা জলপাইগুড়ির তোয়াবুর রহমান। পিতা জনাব ইস্কান্দার মজুমদার ও মাতা বেগম তৈয়বা মজুমদার। তাঁর আদি পৈত্রিক নিবাস ফেনী জেলার ফুলগাজী উপজেলার শ্রীপুর গ্রামের মজুমদার বাড়ি। পিতা জনাব ইস্কান্দার মজুমদার ছিলেন একজন ব্যবসায়ী।",
    },
    {
      id: 5,
      image: img1,
      title: "বৈবাহিক জীবন ও পরিবার",
      content:
        "পাঁচ বছর বয়সে খালেদাকে দিনাজপুরের মিশন স্কুলে ভর্তি করা হয়। তিনি ১৯৬০ সালে দিনাজপুর সরকারি বালিকা উচ্চ বিদ্যালয় থেকে ম্যাট্রিকুলেশন সম্পন্ন করেন। একই বছর তিনি জিয়াউর রহমানকে বিয়ে করেন। এরপর থেকে তিনি খালেদা জিয়া বা বেগম খালেদা জিয়া নামে পরিচিতি পান। স্বামীর সাথে পশ্চিম পাকিস্তানে চলে যাওয়ার আগে তিনি ১৯৬৫ সাল পর্যন্ত দিনাজপুরের সুরেন্দ্রনাথ কলেজে অধ্যয়ন করেন।",
    },
    {
      id: 6,
      image: img1,
      title:
        "বেগম খালেদা জিয়ার পরিবার",
      content:
        "তার স্বামী বাংলাদেশের সাবেক রাষ্ট্রপতি লেফটেন্যান্ট জেনারেল জিয়াউর রহমান বীর উত্তম। জিয়া তখন পূর্ব পাকিস্তান সেনাবাহিনীতে একজন ক্যাপ্টেন ছিলেন। তিনি তখন ডিএফআই-এর কর্মকর্তা হিসেবে দিনাজপুরে কর্মরত ছিলেন। তার এক ভাই মেজর সাঈদ এস্কান্দার বাংলাদেশ জাতীয়তাবাদী দল থেকে ফেনী-১ আসনের নির্বাচিত সংসদ সদস্য ছিলেন। তার দুই ছেলের মধ্যে বড় তারেক রহমান বাংলাদেশ জাতীয়তাবাদী দলের ভারপ্রাপ্ত চেয়ারম্যান। তার ছোট ছেলে আরাফাত রহমান কোকো ছিনেন বিশষ্ট ক্রিড়া অনুরাগী এবং বহু কাজ করে গেছেন এই ক্রিড়া অঙ্গনে। সর্বোপরি তৎকালীন তথা কথিত সেনা সমর্থিত মঈনুদ্দিন ও ফখরুদ্দিনের সময়ে অন্যায়ভাবে চালানো নির্যাতনের শিকার হয়ে ২৪ জানুয়ারী, ২০১৫ইং তারিখে মালয়েশিয়ার ইউনিভার্সিটি মালায়া হাসপাতালে মারা যান।",
    },
    {
      id: 7,
      image: img1,
      title: " এরশাদ সরকারের পতন",
      content:
        "১৯৮৩ সালের সেপ্টেম্বরে, জেনারেল এরশাদের স্বৈরাচারী শাসনের বিরুদ্ধে আন্দোলন বাড়াতে বিএনপি একটি সাত দলীয় জোট গঠন করে। এরশাদের প্রায় নয় বছরের স্বৈরাচারী শাসনে খালেদা জিয়া সাতবার আটক হন। গণ-অভ্যুত্থানের মুখে (খালেদা জিয়ার নেতৃত্বাধীন সাত-দলীয় জোটের আংশিক নেতৃত্বে), রাষ্ট্রপতি এরশাদ ৬ ডিসেম্বর, ১৯৯০-এ পদত্যাগ করেন। তিনি একটি নিরপেক্ষ তত্ত্বাবধায়ক সরকারের কাছে ক্ষমতা হস্তান্তর করেন, যার ফলে তার নয় বছরের স্বৈরাচারী সরকারের অবসান ঘটে। ১৯৯১ সালে, ২৭ ফেব্রুয়ারি, একটি অবাধ ও সুষ্ঠু সাধারণ নির্বাচনের মাধ্যমে খালেদা জিয়া দেশের প্রথম মহিলা প্রধানমন্ত্রী হন।",
    },
    {
      id: 8,
      image: img1,
      title: "খালেদা জিয়ার টানা নেতৃত্ব",
      content:
        "১৯৯৬ সালেও বিএনপির নিরঙ্কুশ বিজয়ের পর খালেদা জিয়া টানা দ্বিতীয় মেয়াদে প্রধানমন্ত্রী হন। খালেদা জিয়া ২০০১ সালে পুনরায় নির্বাচিত হন, দুর্নীতি ও সন্ত্রাস নির্মূলের প্রতিশ্রুতি দিয়ে ক্ষমতায় ফিরে আসেন। 2006 সালে, তিনি তত্ত্বাবধায়ক সরকারের কাছে ক্ষমতা হস্তান্তর করেন। ২০০৭ সালের সেপ্টেম্বরে খালেদা জিয়া মিথ্যা দুর্নীতির মামলায় গ্রেফতার হন।",
    },
    {
      id: 9,
      image: img1,
      title:
        " অর্থনৈতিক সংস্কার ও দুর্যোগ মোকাবিলা",
      content:
        "1991 সালের 20 মার্চ খালেদা জিয়া প্রথমবারের মতো প্রধানমন্ত্রীর দায়িত্ব নেওয়ার মাত্র 39 দিন পর শতাব্দীর সবচেয়ে খারাপ ঘূর্ণিঝড় এবং জলোচ্ছ্বাস দ্বারা দক্ষিণ বাংলাদেশের বিস্তীর্ণ অঞ্চল ক্ষতিগ্রস্ত হয়েছিল। ত্রাণ ও পুনর্বাসন সামগ্রীর তীব্র ঘাটতি সত্ত্বেও তার সরকার। তার মেয়াদে মুদ্রাস্ফীতির হার সর্বকালের সর্বনিম্নে নামিয়ে আনা হয়েছিল এবং শিল্প ও কৃষি প্রবৃদ্ধি ত্বরান্বিত হয়েছিল। ১৯৯১ সালে একটি নতুন শিল্প নীতি ঘোষণা করা হয়েছিল, যা বেসরকারী বিদেশী বিনিয়োগ এবং বেসরকারী খাতের দ্রুত সম্প্রসারণের পথ প্রশস্ত করে, বিশেষ করে ক্ষুদ্র ও মাঝারি উদ্যোগ উপ-খাতে। শতভাগ বিদেশী মালিকানা এবং যৌথ উদ্যোগ কোন সীমাবদ্ধতা ছাড়াই অনুমোদিত ছিল। সরকার প্রাণিসম্পদ খাতের উন্নয়নে সক্রিয়ভাবে প্রচার করেছে, যার ফলে সারা দেশে অসংখ্য পোল্ট্রি ও দুগ্ধ খামার দ্রুত স্থাপন করা হয়েছে। স্থানীয় মুদ্রা প্রথমবারের মতো আংশিকভাবে পরিবর্তনযোগ্য করা হয়েছিল এবং বৈদেশিক মুদ্রার রিজার্ভ সর্বকালের উচ্চ পর্যায়ে পৌঁছেছে। পাঁচ বছরে স্থানীয় সম্পদের অংশ ২১ শতাংশ থেকে বাড়িয়ে ৪০ শতাংশে উন্নীত করে দেশের উন্নয়ন বাজেটে বৈদেশিক সাহায্যের উপর নির্ভরতা কমাতে বাস্তবসম্মত পদক্ষেপ নেওয়া হয়েছে। ১৯৯৩-৯৪ অর্থবছরে দেশে প্রথমবারের মতো উৎপাদন ও আমদানি পর্যায়ে মূল্য সংযোজন কর চালু করা হয়েছিল, যা দেশীয় বাজেটের সংস্থানগুলিকে সংগঠিত করার জন্য নতুন পথ খুলে দিয়েছে। পাশাপাশি, সরকারের মুক্ত-বাজার বাণিজ্য উদারীকরণ নীতির অংশ হিসাবে আমদানি স্তরে শুল্কের উপর ব্যাপক কাটব্যাক ছিল।",
    },
    {
      id: 10,
      image: img1,
      title: "শিক্ষা ও কৃষি খাতে সংস্কারমূলক পদক্ষেপ",
      content:
        "কৃষি উৎপাদন বৃদ্ধি এবং বন্যা কমাতে এই সময়ে খাল খনন কার্যক্রম পুনরায় চালু করা হয়। চতুর্থ পঞ্চবার্ষিক পরিকল্পনা (১৯৯০-৯৫) সময়কালে, শিক্ষা খাতে সর্বোচ্চ বরাদ্দ রাখা হয়েছিল, যার ৭০ শতাংশ প্রাথমিক ও গণশিক্ষা উপখাতে গিয়েছিল। খালেদা সরকার একটি জাতীয় বিশ্ববিদ্যালয় এবং একটি উন্মুক্ত বিশ্ববিদ্যালয় স্থাপন করেছিল এবং দেশের উচ্চশিক্ষা খাতকে সমর্থন করার জন্য বেসরকারি বিশ্ববিদ্যালয় এবং মেডিকেল কলেজ স্থাপনের অনুমতি দেওয়া হয়েছিল। দেশের জনসংখ্যাকে স্বল্পতম সময়ের মধ্যে সাক্ষর করার লক্ষ্যে প্রধানমন্ত্রীর কার্যালয়ের অধীনে একটি পৃথক প্রাথমিক ও গণশিক্ষা বিভাগ তৈরি করা হয়েছে। 1 জুলাই 1993 থেকে সারা দেশে প্রাথমিক শিক্ষা বাধ্যতামূলক করা হয়। জনসংখ্যার দরিদ্র অংশের মধ্যে শিক্ষার প্রসারের জন্য খালেদা সরকার ১৯৯৩ সালে ‘শিক্ষার জন্য খাদ্য’ কর্মসূচি চালু করে। গ্রামীণ এলাকায় মেয়েদের জন্য মাধ্যমিক শিক্ষা বিনামূল্যে করা হয় এবং সারা দেশে মাধ্যমিক স্তরের ছাত্রীদের জন্য উপবৃত্তি কর্মসূচি চালু করা হয়।",
    },
    {
      id: 11,
      image: img1,
      title: "আইন, যোগাযোগ ও খনিজ সম্পদ উন্নয়ন",
      content:
        "দেশের আইন ক্রমাগত হালনাগাদ করার জন্য খালেদা সরকার একটি স্থায়ী আইন কমিশন গঠন করেছিল। দেশের যোগাযোগ নেটওয়ার্কের উন্নয়নে তার প্রথম মেয়াদে উল্লেখযোগ্য পদক্ষেপও নেওয়া হয়েছিল। এর মধ্যে রয়েছে ১৯৯৪ সালের ১৬ অক্টোবর যমুনা বহুমুখী সেতুর ভৌত নির্মাণ কাজের উদ্বোধন, ঢাকা ও চট্টগ্রামের মধ্যে নিরবচ্ছিন্ন সড়ক যোগাযোগের জন্য ঢাকা-চট্টগ্রাম মহাসড়কে মেঘনা-গোমতী সেতু নির্মাণ, চট্টগ্রামে একটি আধুনিক রেলস্টেশন নির্মাণ এবং চট্টগ্রাম বিমানবন্দরকে আন্তর্জাতিক বিমানবন্দরে উন্নীত করার জন্য একটি প্রকল্প গ্রহণ। বাংলাদেশের ইতিহাসে প্রথমবারের মতো, বড়পুকুরিয়া কয়লা খনি এবং মধ্যপাড়া হার্ড রক প্রকল্পের প্রস্তুতিমূলক কাজ সম্পন্ন হয়েছে এবং এই খনির প্রকল্পগুলি সম্পূর্ণরূপে বাস্তবায়নের জন্য চীনা ও কোরিয়ান সংস্থাগুলির সাথে চুক্তি স্বাক্ষরিত হয়েছে। খালেদার প্রথম মেয়াদে ভোলা ও বঙ্গোপসাগরে নতুন গ্যাসক্ষেত্র আবিষ্কৃত হয়।",
    },
    {
      id: 12,
      image: img1,
      title:
        "আন্তর্জাতিক সম্মেলন ও মিডিয়া উন্নয়ন",
      content:
        "1993 সালের এপ্রিলে ঢাকায় সপ্তম সার্ক শীর্ষ সম্মেলন অনুষ্ঠিত হওয়ার মাধ্যমে বাংলাদেশের আন্তর্জাতিক ভাবমূর্তি ব্যাপকভাবে বৃদ্ধি পায়, যেখানে প্রধানমন্ত্রী খালেদা জিয়া আঞ্চলিক ফোরামের চেয়ারপারসন নির্বাচিত হন। সংবাদপত্রের অবাধ স্বাধীনতার কারণে খালেদা জিয়ার প্রথম মেয়াদে পত্রিকা ও সাময়িকীর সংখ্যা প্রায় দ্বিগুণ হয়। দেশের ইতিহাসে প্রথমবারের মতো, সিএনএন এবং বিবিসির মতো স্যাটেলাইট টিভি চ্যানেলগুলিকে বাংলাদেশে তাদের অনুষ্ঠান সম্প্রচারের অনুমতি দেওয়া হয়েছিল এবং অন্যান্য আন্তর্জাতিক চ্যানেলগুলি খুব শীঘ্রই এটি অনুসরণ করে। সেলুলার মোবাইল টেলিফোনও এই সময়ে দেশে যাত্রা শুরু করে।",
    },
    {
      id: 13,
      image: img1,
      title: " প্রশাসনিক সংস্কার ও রাজনৈতিক সহনশীলতা",
      content:
        "এই সময়ে প্রধানমন্ত্রী খালেদা জিয়া কর্তৃক গৃহীত কিছু প্রশাসনিক পদক্ষেপের মধ্যে রয়েছে সরকারি কর্মচারীদের বেতন-ভাতা বৃদ্ধির জন্য জাতীয় বেতন কমিশনের সুপারিশ বাস্তবায়ন; সরকারি চাকরিতে প্রবেশের বয়স ২৭ বছর থেকে বাড়িয়ে ৩০ বছর করা; পেনশন-মঞ্জুরি পদ্ধতির সরলীকরণ এবং সরকারি কর্মচারীদের মৃত্যুর ক্ষেত্রে বিধবা ও সন্তানদের জন্য আজীবন পারিবারিক পেনশন প্রবর্তন; ১৭টি সেক্টরে শ্রমিকদের ন্যূনতম মজুরি নির্ধারণ; বঙ্গোপসাগরে জলদস্যুতা ও চোরাচালান রোধে কোস্টগার্ড গঠন; দেশের স্টক মার্কেটের কার্যকারিতা তত্ত্বাবধানের জন্য একটি সিকিউরিটিজ অ্যান্ড এক্সচেঞ্জ কমিশন গঠন। তার সরকারই প্রথমবারের মতো ভোটারদের মধ্যে ভোটার পরিচয়পত্র বিতরণের জন্য জাতীয় সংসদে একটি বিল প্রণয়ন করে এবং এই উদ্দেশ্যে একটি প্রকল্প চালু করেছিল। প্রশাসনের রাজনীতিকরণ নিয়ে প্রথম খালেদা সরকারের বিরুদ্ধে খুব কমই অভিযোগ ছিল। যাইহোক, তিনি আমলাতন্ত্রের একটি অংশের ক্রোধকে আকর্ষণ করেছিলেন, কারণ তিনি স্থিতাবস্থা পরিবর্তন করার এবং বাংলাদেশ সিভিল সার্ভিসের বিভিন্ন ক্যাডারের মধ্যে বৈষম্য দূর করার চেষ্টা করেছিলেন। প্রথম খালেদা সরকারও ব্যতিক্রমী রাজনৈতিক সহনশীলতা দেখিয়েছিল কারণ বিরোধী রাজনৈতিক দলগুলির সময়কালে রেকর্ড সংখ্যক দেশব্যাপী হরতাল, অবরোধ এবং অন্যান্য ধরনের বিঘ্নিত কর্মকাণ্ড সত্ত্বেও রাজনৈতিক বিরোধীদের বিরুদ্ধে কোনো দমন-পীড়ন বা দমন-পীড়ন চালানো হয়নি।",
    },
    {
      id: 14,
      image: img1,
      title:
        " অর্থনৈতিক প্রবৃদ্ধি ও সামাজিক উন্নয়ন",
      content:
        "প্রধানমন্ত্রী খালেদা জিয়ার তৃতীয় মেয়াদে (২০০১-০৬) আর্থ-সামাজিক অগ্রগতির ক্ষেত্রে দেশের জন্য আরও বেশি লভ্যাংশ বয়ে আনে। বাংলাদেশের ইতিহাসে প্রথমবারের মতো, ২০০২-২০০৬ সময়কালে গড় জিডিপি প্রবৃদ্ধির হার ৬  শতাংশের উপরে ছিল।",
    },
    {
      id: 15,
      image: img1,
      title:
        " অর্থনৈতিক প্রবৃদ্ধি ও বিনিয়োগের প্রসার",
      content:
        "তিনি মাথাপিছু জাতীয় আয় ২০০০-০১ সালে ৩৭৪ মার্কিন ডলার থেকে ২০০৫-০৬ সালে ৪৮২ মার্কিন ডলারে উন্নীত হয়। বৈদেশিক মুদ্রার রিজার্ভ ২০০১ সালে মাত্র ১ বিলিয়ন থেকে ৩ বিলিয়ন ডলার ছাড়িয়েছে। রেমিট্যান্সের প্রবাহ 2001 থেকে প্রায় তিনগুণ বেড়ে 2006 সালের শেষে 5 বিলিয়ন মার্কিন ডলার অতিক্রম করেছে। পরিস্থিতির দক্ষ পরিচালনার কারণে গার্মেন্টস সেক্টর উন্নতি লাভ করতে থাকে। খালেদা সরকারের বিনিয়োগবান্ধব অর্থনৈতিক নীতি ও কৌশলের কারণে শিল্পায়নের ক্ষেত্রে বাংলাদেশের অগ্রগতি বিদেশি ব্যবসায়ীদের দৃষ্টি আকর্ষণ করেছে। ২০০২-২০০৬ সময়কালে বিদেশী প্রত্যক্ষ বিনিয়োগের পরিমাণ একটি উল্লেখযোগ্য ২.৫ বিলিয়ন মার্কিন ডলার ছিল; ২০০৬ সালের মার্চ পর্যন্ত সাড়ে চার বছরে ৬২ হাজার কোটি টাকার প্রায় ৯ হাজার শিল্প প্রকল্প বিনিয়োগ বোর্ডে নিবন্ধিত হয়েছিল, যা আগের পাঁচ বছরের তুলনায় দ্বিগুণেরও বেশি। ফলস্বরূপ, জিডিপিতে শিল্প খাতের অবদান ১৭ শতাংশ ছাড়িয়েছে এবং ২০০৫-২০০৬ অর্থবছরে এই খাতের প্রবৃদ্ধির হার ১০ শতাংশ অতিক্রম করেছে। লোকসানে থাকা এই রাষ্ট্রীয় মালিকানাধীন প্রতিষ্ঠানের কর্মকর্তা-কর্মচারীদের সকল বকেয়া পাওনা পরিশোধ করার পর ২০০৪-০৫ সালে আদমজী জুট মিলের কম্পাউন্ডে একটি নতুন ইপিজেড স্থাপন করা হয়।",
    },
    {
      id: 16,
      image: img1,
      title: " শিক্ষা ক্ষেত্রে সাফল্য",
      content:
        "শিক্ষা খাতেও খালেদা সরকার কিছু সাফল্য অর্জন করেছে। প্রাথমিক বিদ্যালয়ে নিট নথিভুক্তির হার ৯৭ শতাংশে উন্নীত করা হয়েছিল, দ্বাদশ শ্রেণি পর্যন্ত ছাত্রীদের জন্য শিক্ষা বিনামূল্যে করা হয়েছিল এবং স্কুলগুলিতে ছেলে ও মেয়েদের মধ্যে লিঙ্গ সমতা অর্জন করা হয়েছিল। এছাড়া দুটি নতুন গার্লস ক্যাডেট কলেজ এবং মহিলাদের জন্য তিনটি নতুন পলিটেকনিক ইনস্টিটিউটও স্থাপন করা হয়েছে। যুক্তরাষ্ট্রের সহায়তায় চট্টগ্রামে নারীদের জন্য এশিয়ান ইউনিভার্সিটি প্রতিষ্ঠার উদ্যোগও নেওয়া হয়েছে। মাদ্রাসা শিক্ষা ব্যবস্থার আধুনিকায়নের পাশাপাশি খালেদা সরকার কওমি মাদ্রাসার ‘দাওরা’ সনদকে স্বীকৃতি দেওয়ার সিদ্ধান্ত নেয় এবং ফাজিল-কামিল ডিগ্রিকে স্নাতক ও স্নাতকোত্তর ডিগ্রির সমতুল্য করে। উচ্চ শিক্ষার সুযোগ সম্প্রসারণের জন্য বেশ কয়েকটি নতুন পাবলিক বিশ্ববিদ্যালয় স্থাপন করা হয়েছিল, যার বেশিরভাগই বিজ্ঞান ও প্রযুক্তির বিশ্ববিদ্যালয় নিয়ে গঠিত। অনেক নতুন প্রাইভেট বিশ্ববিদ্যালয়কেও চালুর অনুমতি দেওয়া হয়েছে। বৃত্তিমূলক শিক্ষার প্রসারে কার্যকর পদক্ষেপ নেওয়া হয়েছে। বিদ্যমান বৃত্তিমূলক প্রতিষ্ঠানগুলিকে কলেজে উন্নীত করা হয় এবং তাদের সংখ্যা আগের 51টি থেকে 64-এ উন্নীত করা হয়। খালেদা জিয়ার সরকার বাধ্যতামূলক বিনামূল্যে প্রাথমিক শিক্ষা, মেয়েদের জন্য দশম শ্রেণী পর্যন্ত বিনামূল্যে শিক্ষা, ছাত্রীদের জন্য একটি শিক্ষা “উপবৃত্তি” এবং শিক্ষা কার্যক্রমের জন্য খাদ্য প্রবর্তন করে শিক্ষা ক্ষেত্রে যথেষ্ট অগ্রগতি করেছিল। তার সরকার সরকারি চাকরিতে প্রবেশের বয়স-সীমা ২৭ বছর থেকে বাড়িয়ে ৩০ বছর করেছে এবং শিক্ষা খাতে সর্বোচ্চ বাজেট বরাদ্দ করেছে।",
    },
    {
      id: 17,
      image: img1,
      title: " স্বাস্থ্যসেবা কর্মসূচি",
      content:
        "সাধারণ মানুষের দোরগোড়ায় স্বাস্থ্যসেবা ও সমসাময়িক অবকাঠামোগত সুবিধা পৌঁছে দিতে খালেদা সরকার অনেক কর্মসূচিও বাস্তবায়ন করেছে। শয্যা সংখ্যা উপজেলা হাসপাতালে ৩১ থেকে ৫০, নতুন জেলা শহরের হাসপাতালে ৫০ থেকে ১০০ এবং বৃহত্তর জেলা শহরের হাসপাতালে ১০০ থেকে ২৫০ করা হয়েছে। এছাড়া কিছু নতুন মেডিকেল কলেজ ও হাসপাতাল স্থাপন করা হয়। সরকারের গৃহীত পদক্ষেপের কারণে দেশে শিশু ও মাতৃমৃত্যুর হার কমেছে। পরিবার পরিকল্পনা কর্মসূচি জোরদার করায় জনসংখ্যা বৃদ্ধির হার ১.৪৭ শতাংশে নেমে এসেছে।",
    },
    {
      id: 18,
      image: img1,
      title: " প্রশাসনিক উদ্যোগসমূহ",
      content:
        "খালেদা সরকারই তৎকালীন দুর্নীতি দমন ব্যুরোর উত্তরাধিকারী সংস্থা হিসেবে জাতীয় সংসদ কর্তৃক পাসকৃত একটি আইনের মাধ্যমে একটি দুর্নীতি দমন কমিশন গঠন করেছিল। খালেদা সরকারের আরেকটি উল্লেখযোগ্য প্রশাসনিক ব্যবস্থা হল ২০০৫ সালে সরকারি কর্মচারীদের জন্য একটি নতুন জাতীয় বেতন স্কেল প্রবর্তন।",
    },
    {
      id: 19,
      image: img1,
      title: "আন্তর্জাতিক পর্যায়ে নেতৃত্বের সাফল্য",
      content:
        "প্রধানমন্ত্রী খালেদা জিয়ার তৃতীয় মেয়াদে, বাংলাদেশ জাতিসংঘের মানবাধিকার কাউন্সিল, শান্তি বিল্ডিং কমিশন এবং ECOSOC সহ জাতিসংঘের ১৩টি সংস্থায় নির্বাচিত হয়েছিল। এছাড়া বাংলাদেশ আসিয়ান আঞ্চলিক ফোরামের সদস্যপদ লাভ করে। ২০০৫ সালের শীর্ষ সম্মেলন আয়োজনের পর তিনি সার্ক চেয়ারপারসনের দায়িত্বও পালন করেন। জাতিসংঘ শান্তিরক্ষা মিশনে সর্বোচ্চ সংখ্যক সৈন্য প্রেরণ করে বাংলাদেশ এই সময়কালে বিশ্ব শান্তির উদ্যোগে গুরুত্বপূর্ণ ভূমিকা পালন করে। সরকার আন্তর্জাতিক সন্ত্রাসবাদের বিরুদ্ধে যুদ্ধে পশ্চিমাদের সর্বাত্মক সমর্থন দিয়েছিল, কিন্তু একই সাথে খালেদা শাসন বিশ্বের মুসলিম দেশগুলির সাথে পারস্পরিক উপকারী এবং সহযোগিতামূলক সম্পর্ককে শক্তিশালী করার চেষ্টা করেছিল।",
    },
  ];
  const [isOpen, setIsOpen] = useState(false);
  const [modalContent, setModalContent] = useState<{
    title: string;
    content: string;
  } | null>(null);
  const handleOpen = (title: string, content: string) => {
    setModalContent({ title, content });
    setIsOpen(true);
  };

  const handleClose = () => {
    setIsOpen(false);
    setModalContent(null);
  };
  return (
    <Container>
      <div className="my-16">
        <div className="text-center mb-10">
          <h1 className="text-3xl font-bold text-gray-800">
            বেগম খালেদা জিয়ার সংক্ষিপ্ত পরিচিতি
          </h1>
          <p className="text-gray-600 mt-2">দেশনেত্রী বেগম খালেদা জিয়া</p>
        </div>
        <div className="lg:flex gap-10 mb-10">
          <div className="w-[350px] lg:h-[400px] mx-auto">
            <Image
              src={img1}
              alt="Ziaur Rahman"
              className="rounded w-full lg:h-full object-cover"
            />
          </div>
          <div className="lg:w-[840px]">
            <h2 className="text-2xl font-semibold text-gray-700 mb-4 lg:mt-0 mt-10">
              জন্ম ও পরিবার
            </h2>
            <p className="text-gray-600 mb-2 text-justify">
              বেগম খালেদা জিয়ার প্রকৃত নাম খালেদা খানম পুতুল। আগস্ট ১৫, ১৯৪৫
              সালে দিনাজপুরে তিনি জন্ম গ্রহণ করেন। তিন বোন এবং দুই ভাইয়ের মধ্যে
              তিনি তৃতীয়। ভাইয়েরা সবার ছোট। তার পিতামহ হাজী সালামত আলী, মাতামহ
              জলপাইগুড়ির তোয়াবুর রহমান। বাবা জনাব ইস্কান্দর মজুমদার এবং মা
              বেগম তৈয়বা মজুমদার। দিনাজপুর শহরের মুদিপাড়া। আদি পৈতৃকনিবাস ফেনী
              জেলার ফুলগাজী উপজেলার শ্রীপুর গ্রামের মজুমদার বাড়ী। বাবা জনাব
              ইস্কান্দর মজুমদার ছিলেন একজন ব্যবসায়ী। ইস্কান্দার মজুমদার ১৯১৯
              সালে ফেনী থেকে জলপাইগুড়ি যান। বোনের বাসায় থেকে মেট্রিক পাস করেন
              ও পরে চা ব্যবসায়ে জড়িত হন। ১৯৩৭ সালে জলপাইগুড়িতে বিয়ে করেন।
              জলপাইগুড়ির নয়াবস্তি এলাকায় ১৯৪৭ সাল পর্যন্ত বসবাস করেন এবং ১৯৮৪
              সালের ১৫ নভেম্বর মৃত্যুবরণ করেন। মা বেগম তৈয়বা মজুমদার ছিলেন
              একান্তভাবে একজন গৃহিণী । তিনি বেগম খালেদা জিয়ার সঙ্গেই থাকতেন।
              খালেদা পাঁচ বছর বয়সে দিনাজপুরের মিশন স্কুলে ভর্তি হন এরপর তিনি
              দিনাজপুর সরকারি বালিকা উচ্চ বিদ্যালয় থেকে ১৯৬০ সালে
              ম্যাট্রিকুলেশন পাস করেন একই বছর তিনি জিয়াউর রহমানকে বিয়ে করেন।
              এরপর থেকে তিনি খালেদা জিয়া বা বেগম খালেদা জিয়া নামে পরিচিতি লাভ
              করেন। তিনি স্বামীর সাথে পশ্চিম পাকিস্তান এ বসবাসের পূর্বে ১৯৬৫ সাল
              পর্যন্ত দিনাজপুরের সুরেন্দ্রনাথ কলেজ এ পড়াশোনা করেন।
            </p>
          </div>
        </div>
        <div className="grid grid-cols-1 md:grid-cols-2 gap-5">
          {biography.map((data) => (
            <div
              key={data.id}
              className="rounded shadow-lg p-5 grid grid-cols-1 lg:grid-cols-2 gap-5"
            >
              {/* Image section */}
              <div className="order-1 lg:order-2">
                <Image
                  src={data.image}
                  alt=""
                  className="w-full h-full rounded"
                />
              </div>

              {/* Text section */}
              <div className="order-2 lg:order-1">
                <h2 className="text-xl font-bold mb-3 text-center">
                  {data.title}
                </h2>
                <p className="text-justify">
                  {data.content?.slice(0, 300)}{" "}
                  <button
                    className="text-blue-600 text-xs"
                    onClick={() => handleOpen(data.title, data.content)}
                  >
                    ...See All
                  </button>
                </p>
              </div>
            </div>
          ))}
        </div>
        {modalContent && (
          <Modal
            isOpen={isOpen}
            onClose={handleClose}
            title={modalContent.title}
          >
            <p>{modalContent.content}</p>
          </Modal>
        )}
      </div>
    </Container>
  );
};

export default BiographyPage;
